## Data

In [1]:
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

In [4]:
student_df.set_index("student_number", inplace=True)

## nlargest

In [22]:
student_df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [23]:
student_df["age"].nlargest(3)

student_number
202    34
1      24
101    23
Name: age, dtype: int64

In [24]:
student_df["age"].nlargest(3).index

Int64Index([202, 1, 101], dtype='int64', name='student_number')

## nsmallest

In [5]:
student_df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [6]:
student_df["age"].nsmallest(3)

student_number
403    21
101    23
1      24
Name: age, dtype: int64